type GradeType = "大一" | "大二" | "大三" | "大四" | "研究生" | "其他";

export const GRADELIST: GradeType[] = [
  "大一",
  "大二",
  "大三",
  "大四",
  "研究生",
  "其他",
];

type MajorType =
  | "哲学"
  | "经济学"
  | "法学"
  | "教育学"
  | "文学"
  | "历史学"
  | "理学"
  | "工学"
  | "农学"
  | "医学"
  | "军事学"
  | "管理学"
  | "艺术学"
  | "交叉学科";

export const MAJORLIST: MajorType[] = [
  "哲学",
  "经济学",
  "法学",
  "教育学",
  "文学",
  "历史学",
  "理学",
  "工学",
  "农学",
  "医学",
  "军事学",
  "管理学",
  "艺术学",
  "交叉学科",
];

export type TagNameType =
  /* 
  理论指一些与概念相关的内容
  实践指与编程相关的内容
    */
  | "理论"
  | "实践"
  /* 一些分类，或许是一些非计算机专业学生会学习的与计算机相关的课程名称，我不知道还有什么 */
  | "算法"
  | "数据结构"
  | "数据库"
  /* 一些常用编程语言，暂时能想到的 */
  | "C/C++"
  | "Java"
  | "Python"
  /* 一些与环境配置相关的标签 */
  | "环境配置";

export const TAGNAMELIST: TagNameType[] = [
  "理论",
  "实践",
  "算法",
  "数据结构",
  "数据库",
  "C/C++",
  "Java",
  "Python",
  "环境配置",
];
